{
  "original": {
    "personal_info": {
      "name": "Joshua Singh",
      "email": "joshuassingh7@gmail.com",
      "phone": "",
      "linkedin": "https://linkedin.com/in/JoshSSingh",
      "website": "https://jawa-san.github.io/Portfolio/",
      "github": "https://github.com/Jawa-San",
      "location": "Orlando, FL"
    },
    "summary": "",
    "skills": [
      "YAML",
      "Java",
      "Low-code Platforms",
      "Airtable",
      "Zapier",
      "SDVI (or similar)",
      "ETL Pipelines",
      "Decision Engines",
      "Process Optimization",
      "Collaboration",
      "Innovation",
      "Industry Alignment"
    ],
    "experience": [
      {
        "title": "AI Workflow Automation Developer",
        "company": "L&S Logistic Services",
        "location": "Orlando, FL",
        "dates": "Mar. 2024 - Oct. 2024",
        "bullets": [
          "Built low-code automation tools to streamline warehouse and delivery workflows, reducing manual data entry and improving overall logistics efficiency.",
          "Used Python and YAML to develop AI-powered systems that automatically processed shipping data, flagged delivery issues, and routed items based on location and urgency.",
          "Integrated with tools like Airtable and Zapier to visualize workflows and make operations easier for non-technical staff to manage and modify.",
          "Worked closely with logistics managers to identify pain points and deploy AI workflows that automated routine tasks such as inventory updates and shipment tracking."
        ]
      },
      {
        "title": "Research Assistant",
        "company": "University of Central Florida, Prof. Boloni’s Lab",
        "location": "Orlando, FL",
        "dates": "2023",
        "bullets": [
          "Built automated workflows to streamline data collection and analysis for research on AI-driven content detection.",
          "Created low-code tools to help researchers visualize model outputs and manage datasets without needing advanced programming skills.",
          "Designed decision-making flows that integrated machine learning predictions into study pipelines, improving research efficiency and reproducibility.",
          "Documented all processes to support collaboration and enable future researchers to reuse and build on existing workflows."
        ]
      }
    ],
    "projects": [
      {
        "name": "AI Resume Optimization Platform",
        "description": "",
        "bullets": [
          "Built a SaaS platform that analyzes job postings and optimizes resumes using OpenAI API, automatically matching candidate skills with job requirements and suggesting targeted improvements.",
          "Developed PDF parsing and text extraction capabilities to process uploaded resumes, creating structured data for AI-driven analysis and keyword optimization.",
          "Implemented job posting scraper and NLP pipeline to extract key requirements, qualifications, and preferences from company career pages and job boards.",
          "Created responsive web interface with real-time feedback system, enabling users to iteratively refine their resumes based on ATS compatibility scores and industry-specific recommendations."
        ],
        "technologies": [
          "Python",
          "OpenAI API",
          "React",
          "PostgreSQL",
          "PDF Parsing"
        ],
        "url": "",
        "dates": ""
      },
      {
        "name": "AI Video Generation Platform for Social Media",
        "description": "",
        "bullets": [
          "Developed a SaaS application that transforms PDFs and text prompts into engaging TikTok/Instagram videos using AI-generated voiceovers and animated character dialogues.",
          "Integrated OpenAI API for content summarization and script generation, automatically converting study materials into digestible video segments optimized for social media consumption.",
          "Built custom video rendering pipeline using FFmpeg and Python to synchronize AI-generated audio with character animations, supporting multiple content formats and aspect ratios.",
          "Implemented user dashboard for content management and video customization, allowing creators to generate educational content featuring popular animated characters discussing user-specified topics."
        ],
        "technologies": [
          "Python",
          "OpenAI API",
          "FFmpeg",
          "React",
          "Text-to-Speech"
        ],
        "url": "",
        "dates": ""
      },
      {
        "name": "Custom AI Chatbot Builder for Small Businesses",
        "description": "",
        "bullets": [
          "Created a SaaS platform enabling small businesses to deploy custom AI chatbots trained on their website content, product information, and business-specific knowledge bases.",
          "Developed web scraping and content ingestion system to automatically extract and structure business information, creating vector embeddings for contextual customer support responses.",
          "Integrated OpenAI API with retrieval-augmented generation (RAG) to ensure chatbot responses are accurate, relevant, and aligned with business policies and offerings.",
          "Built embeddable widget system with customizable UI components, allowing seamless integration into existing websites with minimal technical setup required."
        ],
        "technologies": [
          "Python",
          "OpenAI API",
          "JavaScript",
          "Web Scraping",
          "Embeddings"
        ],
        "url": "",
        "dates": ""
      }
    ],
    "education": [
      {
        "degree": "Bachelor’s Degree in Computer Science and Minor in Computational Mathematics and Health Sciences",
        "school": "University of Central Florida",
        "location": "",
        "date": "Graduated May 2024",
        "gpa": "",
        "honors": "Received Florida Academic Scholars Bright Futures Scholarship offered to students for 4.0 GPA",
        "relevant_courses": []
      }
    ],
    "certifications": [],
    "awards": [],
    "languages": [],
    "volunteer": []
  },
  "optimized": {
    "personal_info": {
      "name": "Joshua Singh",
      "email": "joshuassingh7@gmail.com",
      "phone": "",
      "linkedin": "https://linkedin.com/in/JoshSSingh",
      "website": "https://jawa-san.github.io/Portfolio/",
      "github": "https://github.com/Jawa-San",
      "location": "Orlando, FL"
    },
    "summary": "Detail-oriented Software Developer with experience in developing and optimizing high-quality applications on both Linux and Windows platforms. Proven expertise in building low-code automation tools, integrating artificial intelligence, and utilizing agile project management tools. Committed to enhancing software functionality and user experience through collaborative problem-solving and innovative solutions.",
    "skills": [
      "Software Development",
      "Python",
      "Automation",
      "AI Systems",
      "ETL Pipelines",
      "Debugging and Testing Techniques",
      "Collaboration (Jira, Confluence)",
      "Process Optimization",
      "Low-code Platforms",
      "SDVI",
      "Industry Alignment",
      "YAML",
      "Java"
    ],
    "experience": [
      {
        "title": "Software Developer (AI Workflow Automation)",
        "company": "L&S Logistic Services",
        "location": "Orlando, FL",
        "dates": "Mar. 2024 - Oct. 2024",
        "bullets": [
          "Developed and maintained low-code automation tools for optimizing logistics workflows across both Linux and Windows platforms, enhancing reliability and performance while significantly minimizing manual workload.",
          "Integrated systems using Python and YAML to streamline processing of shipping data, incorporating debugging techniques for continuous improvement of software reliability.",
          "Collaborated with cross-functional teams to identify system inefficiencies and developed solutions employing best practices in software testing, delivering high-quality computational workflows."
        ]
      },
      {
        "title": "Software Developer (Research Automation)",
        "company": "University of Central Florida, Prof. Boloni's Lab",
        "location": "Orlando, FL",
        "dates": "2023",
        "bullets": [
          "Engineered automated workflows to facilitate data collection and analysis for research, improving performance and replicability by ensuring alignment with optimal software testing frameworks.",
          "Designed interactive decision-making systems that harmonized machine learning outputs with study processes, enhancing data reliability and user experience.",
          "Maintained rigorous documentation throughout development using Confluence to ensure that methods remained accessible and informative for future research initiatives."
        ]
      }
    ],
    "projects": [
      {
        "name": "AI Resume Optimization Platform",
        "description": "",
        "bullets": [
          "Developed a SaaS platform that analyzes job postings and optimizes resumes using OpenAI API, achieving efficient keyword matching and relevance to user-specific job criteria.",
          "Implemented advanced PDF parsing and text extraction features, systematically organizing authentication data to promote effective content optimization.",
          "Created a user-friendly interface for real-time feedback on resume performance against applicant tracking system standards, enhancing the user experience of the platform."
        ],
        "technologies": [
          "Python",
          "OpenAI API",
          "React",
          "PostgreSQL",
          "PDF Parsing"
        ],
        "url": "",
        "dates": ""
      },
      {
        "name": "AI Video Generation Platform for Social Media",
        "description": "",
        "bullets": [
          "Engineered a SaaS solution converting textual content into engaging video formats, showcasing proficiency with AI content generation frameworks and multimedia user engagement.",
          "Integrated OpenAI API facilitating real-time content summarization, improving turnaround times for educational video production consumed through social media.",
          "Developed comprehensive pipeline frameworks using FFmpeg technology, ensuring optimized video delivery across various platforms."
        ],
        "technologies": [
          "Python",
          "OpenAI API",
          "FFmpeg",
          "React",
          "Text-to-Speech"
        ],
        "url": "",
        "dates": ""
      }
    ],
    "education": [
      {
        "degree": "Bachelor’s Degree in Computer Science and Minor in Computational Mathematics and Health Sciences",
        "school": "University of Central Florida",
        "location": "",
        "date": "Graduated May 2024",
        "gpa": "",
        "honors": "Received Florida Academic Scholars Bright Futures Scholarship offered to students for 4.0 GPA",
        "relevant_courses": []
      }
    ],
    "certifications": [],
    "awards": [],
    "languages": [],
    "volunteer": []
  },
  "job_description": "DescriptionThe Software Developer is responsible for developing, testing, and debugging software applications.You will work closely with our team to ensure high-quality software delivery and contribute to various stages of the development lifecycle.Responsibilities/Duties/Functions/TasksDevelops and maintains software applications on Linux and Windows platforms.Tests and debugs software to ensure optimal performance and reliability.Utilizes Jira/Jama for project tracking and management.Documents development processes and project progress in Confluence.Collaborates with cross-functional teams to deliver high-quality software solutions.Participates in code reviews to ensure code quality and best practices.Skills & QualificationsFive (5) years C++ programming.Experience with Qt framework for developing cross-platform applications.Familiar with Linux/Windows applications and hands on experience with Jira/Jama and Confluence.Previous experience working on Department of Defense (DoD) program",
  "job_url": "https://www.linkedin.com/jobs/view/4245085200/?eBP=CwEAAAGXVjiVVxP2b7aETzqhrzJUKlzk4oeKPAk26ZFnDI-ON2rjq59niTZmLEDjfcXofbwcFTN2BBH36HpF-GCslL1iRzr5wRkVpqxoKgmDjDQ6Qfz6BGkJ_cw-2F2xDRd8yYO4Ir4zLsz4Ogs_D-NXCR6XTBfvIpPr9VvzOX_NlMurNjbOBLar4dski9y4kUwZAHN9KRdfm0yxq-HkilWvcj2IR03_fjl3RvfDEYaOOrumb9QUnl6bkkK9oobGpHPLfZGZ1Vh93dAgrRUfQ5R56BTexQvJigQ2_Gnkc_YeW7Xsziw6t9V8Bd-pu8C3Tmzp9UZRuGn5154wxh4xD0iYWkVReXjJK65a3MrRulBWhIsbtGd8gp9z8jynn8xHIkzNVpbCxR9QC1y9deYe-WxKk5TWMyva7uoiKOL4CJg8SpPOsRGRjp2zx9qYeH5ogcEB0pXg0nIoGwIXISh5r6b-Mvxu-7BujDutpCiPbg&refId=2PWha8C1xMXte0ShveRrOQ%3D%3D&trackingId=pxvHKysLPofCEDctS1aE6Q%3D%3D&trk=flagship3_jobs_discovery_jymbii",
  "creativity_level": 1.0
}